Repository: contributoragreements/contributoragreements.org
Catalog: system/modules/dk_mmenu/languages/*/*_module.xlf
Languages: ru

# tl_module.mmenu_appearance_legend
source: mmenu appearance
ru: mmenu внешний вид

# tl_module.mmenu_behaviour_legend
source: mmenu behaviour
ru: mmenu поведение

# tl_module.mmenu_effects_legend
source: mmenu effects
ru: mmenu эффекты

# tl_module.mmenu_legend
source: mmenu settings
ru: mmenu настройки

# tl_module.dk_mmenuPosition.0
source: Position of menu
ru: Позиция меню

# tl_module.dk_mmenuPosition.1
source: Choose the position of the menu.
ru: Выберите позицию из меню.

# tl_module.dk_mmenuZposition.0
source: Z-position of menu
ru: Z-позиция меню

# tl_module.dk_mmenuZposition.1
source: Choose the z-position of the menu.
ru: Выберите Z-позицию из меню.

# tl_module.dk_mmenuSlidingSubmenus.0
source: Kind of menu
ru: Вид меню

# tl_module.dk_mmenuSlidingSubmenus.1
source: Determines whether submenus should come sliding in from the right or to expand below.
ru: Определяет, должно ли подменю скользить справа или расширяться снизу.

# tl_module.dk_mmenuTheme.0
source: Theme of menu
ru: Тема меню

# tl_module.dk_mmenuTheme.1
source: Choose a theme for the menu.
ru: Выберите тему меню.

# tl_module.dk_mmenuMoveBackground.0
source: Move background
ru: Переместить фон

# tl_module.dk_mmenuMoveBackground.1
source: Determines whether or not the page should inherit the background of the body when the menu opens.
ru: Определяет, должна ли страница наследовать фон тела, когда открывается меню.

# tl_module.dk_mmenuFullscreen.0
source: Fullscreen
ru: Полноэкранное

# tl_module.dk_mmenuFullscreen.1
source: Determines whether the menu will fill up 80% (default) of the available width/height or 100% (fullscreen).
ru: Определяет, будет ли меню заполнять 80% (по умолчанию) доступной ширины/высоты или будет 100% (полноэкранным).

# tl_module.dk_mmenuCountersAdd.0
source: Show submenu counter
ru: Показать счетчик подменю

# tl_module.dk_mmenuCountersAdd.1
source: Determines whether or not to append a counter to each menu item if it has a submenu and automatically counting the number of items inside.
ru: Определяет, следует ли добавить счетчик на каждый из пунктов меню, если он будет как подменю и автоматически посчитает количество элементов внутри.

# tl_module.dk_mmenuCountersUpdate.0
source: Update submenu counter
ru: Обновить счетчик подменю

# tl_module.dk_mmenuCountersUpdate.1
source: Determines whether or not to automatically count the number of items in the submenu, updates when typing in the search field.
ru: Определяет, следует ли автоматически подсчитать количество элементов в подменю, обновляется при вводе в поле поиска.

# tl_module.dk_mmenuSearchfieldAdd.0
source: Show searchfield
ru: Показать поле поиска

# tl_module.dk_mmenuSearchfieldAdd.1
source: Determines whether or not to automatically prepend a searchfield to the menu.
ru: Определяет, следует ли автоматически вставлять поле поиска в меню.

# tl_module.dk_mmenuEffectSlide.0
source: Slide in
ru: Соскальзывать

# tl_module.dk_mmenuEffectSlide.1
source: Makes the menu slide in from the side.
ru: Создает эффект скользящего в стороны меню.

# tl_module.dk_mmenuEffectZoomMenu.0
source: Zoom menu
ru: Увеличить меню

# tl_module.dk_mmenuEffectZoomMenu.1
source: Makes the menu zoom in.
ru: Создает эффект увеличения меню.

# tl_module.dk_mmenuEffectZoomPage.0
source: Zoom page
ru: Увеличить страницу

# tl_module.dk_mmenuEffectZoomPage.1
source: Makes the page zoom in while opening the menu, works great in combination with the mm-zoom-menu effect.
ru: Создает эффект увеличения страницы при открытии меню, прекрасно работает в сочетании с эффектом 'Увеличить меню'.

# tl_module.dk_mmenuEffectZoomPanels.0
source: Zoom panels
ru: Увеличить панели

# tl_module.dk_mmenuEffectZoomPanels.1
source: Makes the panels zoom out while opening a submenu.
ru: Создает эффект увеличения панели при открытии подменю.

# tl_module.dk_mmenuDragOpenOpen.0
source: Drag page to open menu
ru: Перетаскивание страницы, для открытия меню

# tl_module.dk_mmenuDragOpenOpen.1
source: Determines whether or not the menu should open when dragging the page.
ru: Определяет, следует ли открывать меню при перетаскивании страницы.

# tl_module.dk_mmenuDragOpenThreshold.0
source: Amount of pixels to drag
ru: Количество пикселей для перетаскивания

# tl_module.dk_mmenuDragOpenThreshold.1
source: Determines the minimum amount of pixels to drag before actually opening the menu, less than 50 is not advised.
ru: Определяет минимальное количество пикселей для перетаскивания, перед фактическим открытием меню. Ставить менее 50 не рекомендуется.

# tl_module.dk_mmenuOnClickClose.0
source: Menu closes after click
ru: Закрывать меню после нажатия

# tl_module.dk_mmenuOnClickClose.1
source: Determines whether or not the menu should close after clicking a link inside it.
ru: Определяет, следует ли закрывать меню после нажатия на ссылку внутри него.

# tl_module.dk_mmenuOnClickBlockUI.0
source: Block user interface
ru: Блокировать интерфейс пользователя

# tl_module.dk_mmenuOnClickBlockUI.1
source: Determines whether or not to block the user interface while loading the new page.
ru: Определяет, следует ли блокировать пользовательский интерфейс при загрузке новой страницы.

# tl_module.dk_mmenuModal.0
source: modal menu
ru: Модальное меню

# tl_module.dk_mmenuModal.1
source: Determines whether or not the menu should be modal. A close button has to be provided.
ru: Определяет, должно ли быть меню модальным. Кнопка закрытия должна быть представлена.

# tl_module.dk_mmenuArticle.0
source: mmenu article
ru: mmenu статья

# tl_module.dk_mmenuArticle.1
source: Choose the article.
ru: Выберите статью.

# tl_module.dk_mmenuHtmlTpl.0
source: HTML template
ru: HTML-шаблон

# tl_module.dk_mmenuHtmlTpl.1
source: Choose the HTML template.
ru: Выберите HTML-шаблон.

# tl_module.dk_mmenuJsTpl.0
source: JavaScript template
ru: Шаблон JavaScript

# tl_module.dk_mmenuJsTpl.1
source: Choose the JavaScript template.
ru: Выберите шаблон JavaScript.

# tl_module.dk_mmenuPosition.left
source: left
ru: слева

# tl_module.dk_mmenuPosition.right
source: right
ru: справа

# tl_module.dk_mmenuPosition.top
source: top
ru: сверху

# tl_module.dk_mmenuPosition.bottom
source: bottom
ru: снизу

# tl_module.dk_mmenuZposition.back
source: back
ru: сзади

# tl_module.dk_mmenuZposition.front
source: front
ru: спереди

# tl_module.dk_mmenuZposition.next
source: next
ru: следующий

# tl_module.dk_mmenuTheme.black
source: black
ru: черная

# tl_module.dk_mmenuTheme.standard
source: dark
ru: темная

# tl_module.dk_mmenuTheme.light
source: medium grey (light)
ru: серая (средне)

# tl_module.dk_mmenuTheme.lighter
source: light grey (light)
ru: серая (светло)

# tl_module.dk_mmenuTheme.lightest
source: light
ru: светлая

# tl_module.dk_mmenuTheme.white
source: white
ru: белая

# tl_module.dk_mmenuTheme.army
source: army (dark)
ru: армейская (темная)

# tl_module.dk_mmenuTheme.bordeaux
source: bordeaux (dark)
ru: бордо (темное)

# tl_module.dk_mmenuTheme.navy
source: navy (dark)
ru: синяя (темная)

# tl_module.dk_mmenuSlidingSubmenus.horizontal
source: horizontal
ru: горизонтальное

# tl_module.dk_mmenuSlidingSubmenus.vertical
source: vertical
ru: вертикальное
